[
  {
    "name": "Microsoft Authorized Refurbished- HP Elite Desktop PC Computer Intel Core i5 3.1-GHz, 8 gb Ram, 1 TB Hard Drive, DVDRW, 19 Inch LCD Monitor, Keyboard, Mouse, USB WiFi, Windows 10 (Renewed) ",
    "price": 212.69,
    "shippingCost": 67.32,
    "description": "POWERFUL PROCESSOR - Built with an Intel Core i5 processor, you can expect fast, reliable performance and an exceptional PC experience. SUPERIOR STORAGE AND MEMORY - Plenty of storage space to save your favorite media and still have tons of room to work. The high amount of memory will help you zip through your tasks in a hurry. BUILT IN CONNECTIVITY - Stay connected to the internet with USB WiFi adapter. Play your favorite tunes with stereo sound. Connect to large and multiple monitors thanks to onboard Display Port technology. Genuine Windows Software:Help keep your business data safe when you buy used Windows computers, preinstalled with genuine Microsoft software from a Microsoft Authorized Refurbisher, (MAR).WINDOWS 10 LATEST RELEASE - A new, clean installation completely free of bloatware that would have typically been installed from the OEM. Optional software such as Anti-Virus and Office 365 can be easily downloaded through the Windows App Store.   ",
    "images": [
      "https://m.media-amazon.com/images/I/714T3JNoA3S._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/6126hV4idnS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Rq2wgIXhL._AC_SL1500_.jpg"
    ],
    "categories": ["Computers", "Pc Desktop"]
  },
  {
    "name": "Acer Aspire TC-1660-UA92 Desktop | 10th Gen Intel Core i5-10400 6-Core Processor | 12GB 2666MHz DDR4 | 512GB NVMe M.2 SSD | 8X DVD | Intel Wireless Wi-Fi 6 | Bluetooth 5.2 | Windows 10 Home ",
    "price": 549.0,
    "shippingCost": 49.84,
    "description": "ROBUST COMPUTING HUB: Tackle any task—from basic computing to multimedia entertainment—every time you power up this beastly machine. Easily expandable and driven by an Intel Core i5 processor, it has the speed, power and storage to do more—everyday!. 10th Generation Intel Core i5-10400 6-Core Processor (Up to 4.3GHz). 12GB 2666MHz DDR4 Memory | 512GB NVMe M.2 SSD | 8X DVD-Writer Double-Layer Drive (DVD-RW). Intel Wireless Wi-Fi 6 AX201 802.11ax Dual-Band 2.4GHz and 5GHz featuring 2x2 MU-MIMO technology | Bluetooth 5.2 | 10/100/1000 Gigabit Ethernet LAN. 1 - USB 3.2 Type C Gen 2 port (up to 10 Gbps) (Front) | 1 - USB 3.2 Gen 2 Ports (Front) | 2 - USB 3.2 Gen 1 Type A Ports (Rear) | 4 - USB 2.0 Ports (Rear) | 2 - HDMI Ports (Rear). Windows 10 Home | USB Keyboard and Mouse Included. ",
    "images": [
      "https://m.media-amazon.com/images/I/616BXacLrRS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61nlgERWGqS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81TFYhzaZVS._AC_SL1500_.jpg"
    ],
    "categories": ["Computers", "Pc Desktop"]
  },
  {
    "name": "Lenovo IdeaCentre AIO 3 AMD All-in-One Computer, 24' FHD Display, Ryzen 5 5500U, 16GB RAM, 512GB SSD, DVD RW Drive, Windows 11 ",
    "price": 749.99,
    "shippingCost": 39.25,
    "description": "This space-saving AIO PC hides raw, unfiltered power - with an AMD Ryzen 5 55000U processor, the IdeaCentre AIO 3 thrives under heavy performance loads. We designed the slim and compact all-in-one computer for ease and convenience with fewer cables and clutter, a dock for your cell phone, plus instant privacy and instant login features for better security; wireless keyboard and mouse included. View more of the screen with this AIO computer's three-sided narrow bezel FHD display for vibrant colors with crystal-clear quality from almost any angle; plus, the IdeaCentre AIO 3 streams high-octane, sharply etched audio over its two 3W stereo speakers certified by Harman Kardon. The hidden camera on the top of the AIO 3 offers up to 5M clarity, enhancing authenticity during your video chatting or conferencing – push the webcam down for extra security. Connect with two USB 2.0 ports and two USB 3.2 Gen 2 Type-A ports, one 1000 LAN, one microphone/earphone combo, one Power DC Jack and one HDMI-out.",
    "images": [
      "https://m.media-amazon.com/images/I/71guoY+nr7L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51ZVBPRGA-L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81tCxgRgMcL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ld4r8k-wL._AC_SL1500_.jpg"
    ],
    "categories": ["Computers", "Pc Desktop"]
  },
  {
    "name": "Gaming PC Desktop Computer by Alarco Intel i5 3.10GHz,8GB Ram,1TB Hard Drive,Windows 10 pro,WiFi Ready,Video Card Nvidia GTX 650 1GB, 3 RGB Fans with Remote ",
    "price": 499.99,
    "shippingCost": 49.99,
    "description": "Runs Fortnite average 100 FPS on Low Settings and 60 FPS on medium settings. Runs Pubg average 30 FPS on low settings. Runs GTA5 average 30 FPS. Intel Core i5-2400 3.10 Ghz. GTX 650 1GB Video Card With DVI, HDMI and VGA outputs. 1 Year Warranty.",
    "images": [
      "https://m.media-amazon.com/images/I/71z7ztyH1LL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71JVLn70koL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71lYdxxNBWL._AC_SL1500_.jpg"
    ],
    "categories": ["Computers", "Pc Desktop", "Gaming"]
  },
  {
    "name": "SkyTech Archangel 3.0 Gaming Computer PC Desktop - Ryzen 5 3600 6-Core 3.6GHz, RTX 3060 12GB, 1TB SSD, 16GB DDR4 3200, RGB Fans, AC WiFi, 600W Gold PSU, Windows 10 Home 64-bit, White ",
    "price": 1399.99,
    "shippingCost": 39.99,
    "description": "AMD Ryzen 5 3600 6-Core 3.6 GHz (4.2 GHz Turbo) CPU Processor | 1TB SSD. GeForce RTX 3060 12GB GDDR6 Graphics Card (Brand May Vary) | 16GB DDR4 3200MHz Gaming Memory with Heat Spreaders | Windows 10 Home 64-bit. 802.11AC | No Bloatware | Graphic output options include 1 x HDMI, and 1 x Display Port Guranteed, Additional Ports may vary | USB Ports Including 2.0, 3.0, and 3.2 Gen1 Ports | HD Audio and Mic | Free Gaming Keyboard and Mouse. Heatsink & 3 x RGB Fans | Powered by 80 Plus Gold Certified 600 Watt Power Supply | Skytech Archangel 3.0 Gaming Case with Tempered Glass – White. 1 Year Warranty on Parts and Labor | Lifetime Free Technical Support | Assembled in the USA | This powerful gaming PC is capable of running all your favorite games such as World of Warcraft, League of Legends, Grand Theft Auto V, Apex Legends, Fortnite, Roblox, PLAYERUNKNOWN’s Battlegrounds, Overwatch, Counter-Strike: Global Offensive, Battlefield V, Minecraft, The Division 2, and more at High to Ultra settings, crisp 1440p Full HD resolution and smooth 60+ FPS game play. ",
    "images": [
      "https://m.media-amazon.com/images/I/81GZeBFAzSS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/913c4IJx+pS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61YkzShkk9S._AC_SL1500_.jpg"
    ],
    "categories": ["Computers", "Pc Desktop", "Gaming"]
  },
  {
    "name": "Acer Predator Orion 3000 PO3-630-UA15 Gaming Desktop | 11th Gen Intel Core i7-11700F 8-Core | GeForce RTX 3070 | 16GB DDR4 | 512GB NVMe SSD | 1TB HDD | Wi-Fi 6 | Windows 11 Home | RGB Keyboard & Mouse ",
    "price": 1699.99,
    "shippingCost": 45.89,
    "description": "11th Generation Intel Core i7-11700F 8-Core Processor (Up to 4.9GHz), 16GB DDR4 3200MHz Memory (expandable to 64GB), 512GB NVMe M.2 SSD, 1TB 7200RPM HDD. NVIDIA GeForce RTX 3070 Graphics with 8GB of GDDR6 Video Memory (3 x Display Ports & 1 x HDMI Port). DTS X: Ultra Audio, Intel Wireless Wi-Fi 6 AX201 802.11ax, Killer Ethernet E2600 10/100/1000 Gigabit Ethernet. 1 - USB 3.2 (Type C) Gen 2 Port (Up to 10Gbps) (Front), 1 - USB 3.2 Gen 2 Port (Front), 1 - USB 3.2 (Type C) Gen 2x2 port (Up to 20Gbps) (Rear), 2 - USB 3.2 Gen 1 Type-A Ports (Rear), 2 - USB 2.0 ports (Rear). Predator RGB Gaming Keyboard and Predator RGB Gaming Mouse Included, Comes with Windows 11.",
    "images": [
      "https://m.media-amazon.com/images/I/81OoaPmgzQL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61BqM1OBg1L._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/61D688R5MtL._AC_SL1000_.jpg"
    ],
    "categories": ["Computers", "Pc Desktop", "Gaming"]
  },
  {
    "name": " Logitech MK345 Wireless Combo Full-Sized Keyboard with Palm Rest and Comfortable Right-Handed Mouse, 2.4 GHz Wireless USB Receiver, Compatible with PC, Laptop ",
    "price": 49.74,
    "shippingCost": 15.89,
    "description": "Full-size Keyboard Layout: Comfortable, quiet typing on a familiar keyboard layout with generous palm rest, spill-resistant design (2), and easy-access media keys like mute, volume, and play. Comfortable Right-handed Mouse: This wireless USB mouse features a hand-friendly contoured shape for all-day comfort, plus smooth, precise tracking and scrolling for easier navigation. Reliable Connection: Advanced 2.4 GHz wireless connection delivers the reliability and speed of a corded connection with wireless convenience and freedom up to 33 ft away (3), at home or at work. Extended Battery: Say goodbye to the hassle of charging cables and changing batteries and get up to 3 years of battery life for the keyboard and 18 months for the mouse (1) with MK345. Compatibility: This keyboard mouse set works with PCs using Windows or Chrome operating systems; simply plug in to your laptop or desktop computer and begin using. Upgrade to Logitech MK540 Combo: For increased comfort try MK540 wireless keyboard and mouse combo, with scooped keys, a palm rest, a full-size mouse with soft rubber grips, and customizable shortcuts.",
    "images": [
      "https://m.media-amazon.com/images/I/61S0sV1a57L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71a9iHlX2fL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71FJ0dmwniL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71oPLv+G8EL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral"]
  },
  {
    "name": "Redragon S101 Wired Gaming Keyboard and Mouse Combo RGB Backlit Gaming Keyboard with Multimedia Keys Wrist Rest and Red Backlit Gaming Mouse 3200 DPI for Windows PC Gamers (Black) ",
    "price": 35.98,
    "shippingCost": 13.58,
    "description": "PC GAMING KEYBOARD AND GAMING MOUSE COMBO: Includes Redragon RGB Backlit Computer Gaming Keyboard and RGB Backlit Gaming Mouse. ALL-IN-ONE PC GAMER VALUE KIT, Fantastic for Gamers (New Improved Version). RGB BACKLIT GAMING KEYBOARD; 7 different RGB Lighting modes & effects, 4 backlight brightness levels, adjustable breathing speed. The keycaps offering clear uniform backlighting WIN key can be disabled for gaming. The PC Gaming Keyboard has been ergonomically designed to be a superb typing tool for office work as well. The gaming Keyboard is built to withstand the average liquid spill. The integrated wrist rest gives you the comfort you need for marathon gaming sessions. MULTI MEDIA & ANTI GHOSTING; The Gaming Keyboard has 25 conflict free (n-Key Rollover) 10 Dedicated Multimedia keys plus 12 additional FN+ Multimedia keys (Total 114 keys). Keys are quiet, designed for longevity, durability delivering precise tactile feedback. Comes with Full numeric keypad and a gold-plated corrosion free USB connector for a reliable connection and ultimate Gaming performance. WIRED GAMING MOUSE; Ergonomic Redragon RED Backlit Gaming Mouse up to 3200 DPI (user adjustable 800/1600/2400/3200 DPI), 30G acceleration and Weight Tuning set. Total 6 Buttons of which 5 are programmable. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability and extreme responsiveness, giving you an even greater edge over your competition. PC GAMING KEYBOARD AND GAMING MOUSE COMPATIBILITY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS keyboard support. Works well with all major Computers Brands and Gaming PCs.",
    "images": [
      "https://m.media-amazon.com/images/I/71kr3WAj1FL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71uIslKmtoL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71H6y1GGbAL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71z+9JkYFJL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral"]
  },
  {
    "name": "Rii Primer RGB Compact Gaming Office Keyboard RK104,Backlight Keyboard,Small 87 Keys No Number Pad Keyboard for Windows PC Laptop Desktop",
    "price": 10.49,
    "shippingCost": 4.5,
    "description": "[LED Mixed Color Backlit]Colorful LED light backlit ,it makes the keys easy to see even in the dark,the light is soft to protect your eyes.NOTE:The backlight cann't be change in one color,it's rainbow and changed automatically. [Compact 87 keys Design Save Space]No additional number keys,can meet you demands in office or home ,you will be satified at how much space you save. [System Compatibility]Windows 8, Windows 7, Windows Vista, Windows XP.PC Laptop Pad Google Android TV Box HTPC IPTV Smart TV Mac IOS Raspberry Pi all version. [Good Quality but cheap]ABS keycaps design product the letter of characters not fade.Enjoy yourself with the payment more than what you've paid. After-sales service]We provide refund without any reason in 30 days,12-month quality guarantee, If you have any problem during the use ,hope you could send message to us firstly and we will try to help you in time.",
    "images": [
      "https://m.media-amazon.com/images/I/71iavnEuc2L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71sAev97FDL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81YWmodg4+L._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Keyboards"]
  },
  {
    "name": "Verbatim Slimline Full Size Wired Keyboard USB Plug-and-Play - Compatible with PC, Laptop - Black ",
    "price": 8.95,
    "shippingCost": 5.78,
    "description": "Affordable, corded keyboard featuring slim design and full numeric keypad. Low-profile, advanced tactile keys for quiet, comfortable typing. Adjustable tilt legs for added comfort. Simple, plug-and-play USB corded connection - PC, Mac and Chrome OS compatible. Verbatim has been a leader in data storage technology since 1969, and guarantees this product with a 1-year limited warranty and technical support.",
    "images": [
      "https://m.media-amazon.com/images/I/719LFu+MawL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/710UmAJF5nL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81sixpQPW1L._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Keyboards"]
  },
  {
    "name": "Logitech M510 Wireless Computer Mouse for PC with USB Unifying Receiver - Graphite",
    "price": 29.99,
    "shippingCost": 12.99,
    "description": "Your hand can relax in comfort hour after hour with this ergonomically designed mouse. Its contoured shape with soft rubber grips, gently curved sides and broad palm area give you the support you need for effortless control all day long. You’ve got the control to do more, faster. Flipping through photo albums and Web pages is a breeze, especially for right-handers—with three standard buttons plus Back/Forward buttons that you can also program to switch applications, go full screen and more. And side-to-side scrolling plus zoom gives you the power to scroll horizontally and vertically through your music library, maps and Facebook feeds, and zoom in and out of photos and budget spreadsheets with a click. 2 years of battery life practically eliminates the need to replace batteries. The On/Off switch helps conserve power, smart sleep mode extends battery life and an indicator light eliminates surprises. The tiny Logitech Unifying receiver stays in your laptop. There’s no need to unplug it when you move around, so there’s less worry of it being lost. And you can easily add compatible wireless mice and keyboards to the same wireless receiver. ",
    "images": [
      "https://m.media-amazon.com/images/I/61xgpXecLML._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61nAuaWzAfL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61oJmQ+ajhL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/611DG-+B2XL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Mouse"]
  },
  {
    "name": "NexiGo N60 1080P Web Camera, HD Webcam with Microphone, Software Control & Privacy Cover, USB Computer Camera, 110-degree FOV, Plug and Play, for Zoom/Skype/Teams, Conferencing and Video Calling ",
    "price": 39.99,
    "shippingCost": 10.0,
    "description": "Full HD 1080P Webcam】Powered by a 1080p FHD two-MP CMOS, the NexiGo N60 Webcam produces exceptionally sharp and clear videos at resolutions up to 1920 x 1080 with 30fps. The 3.6mm glass lens provides a crisp image at fixed distances and is optimized between 19.6 inches to 13 feet, making it ideal for almost any indoor use. 【USB Webcam with Privacy Protection Cover】The privacy cover blocks the lens when the webcam is not in use. It's perfect to help provide security and peace of mind to anyone, from individuals to large companies. It also helps to protect the lens from dirt and debris to ensure your video remains clear for the life of the camera. 【Built-in Noise-Cancelling Microphone】The built-in noise-canceling microphone reduces ambient noise to enhance the sound quality of your video. Great for Zoom / Facetime / Video Calling / OBS / Twitch / Facebook / YouTube / Conferencing / Gaming / Streaming / Recording / Online School. 【Plug and Play】The fixed focal length lens captures high-definition video at a wide-angle of up to 110°, making it ideal for presentations. Just plug the USB into your computer and you are good to go! A convenient mounting clip allows the webcam to be placed on any monitor / laptop / TV/ tripod. 【Wide Compatibility】Works with USB 2.0/3.0, no additional drivers required. Ready to use in approximately one minute or less on any compatible device. Compatible with Mac OS X 10.7 and higher / Windows 7, 8, 10 & 11 / Android 4.0 or higher / Linux 2.6.24 / Chrome OS 29.0.1547 / Ubuntu Version 10.04 or above. ",
    "images": [
      "https://m.media-amazon.com/images/I/51xRoLtOjgS._AC_SL1463_.jpg",
      "https://m.media-amazon.com/images/I/61Fc5OJ7k8S._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/613BcIP31mS._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/51qSFGA3s0S._AC_.jpg"
    ],
    "categories": ["Peripheral", "Cameras"]
  },
  {
    "name": "Arteck 2.4G Wireless Keyboard Stainless Steel Ultra Slim Full Size Keyboard with Numeric Keypad for Computer/Desktop/PC/Laptop/Surface/Smart TV and Windows 10/8/ 7 Built in Rechargeable Battery ",
    "price": 27.99,
    "shippingCost": 12.0,
    "description": "Easy Setup: Simply insert the nano USB receiver into your computer and use the keyboard instantly. Ergonomic design: Stainless steel material gives heavy duty feeling, low-profile keys offer quiet and comfortable typing. 6-Month Battery Life: Rechargeable lithium battery with an industry-high capacity lasts for 6 months with single charge (based on 2 hours non-stop use per day). Ultra Thin and Light: Compact size (16.9 X 4.9 X 0.6in) and light weight (14.9oz) but provides full size keys, arrow keys, number pad, shortcuts for comfortable typing. Package contents: Arteck Stainless 2.4G Wireless Keyboard, nano USB receiver, USB charging cable, welcome guide, our 24-month warranty and friendly customer service. ",
    "images": [
      "https://m.media-amazon.com/images/I/615wODNPYJL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/617hYEC8n0L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61weBdbKqkL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Keyboards"]
  },
  {
    "name": "NPET K10 Gaming Keyboard, LED Backlit, Spill-Resistant Design, Multimedia Keys, Quiet Silent USB Membrane Keyboard for Desktop, Computer, PC (Black) ",
    "price": 20.99,
    "shippingCost": 39.99,
    "description": "Durable Gaming Keyboard: 104 Key Wired USB Gaming Keyboard with quiet keys for longevity, durability, and responsiveness delivering precise tactile feedback for flawless gaming performance. LED Backlighted Keyboard: 4 LED lighting backlit modes, breathing(7-color alternate). 3 Adjustable permanent mixed backlit modes, changeable breathing, or permanent lighting mode. The keycaps offer clear uniform backlighting. Ergonomic Splash-Proof Design: The PC Gaming Keyboard has been ergonomically designed to be a superb typing tool for office work as well. You'll love the feel and keystroke accuracy, which leads to fewer errors and typos. Multi-Media & Anti Ghosting: It has 26 conflict-free, 13 multi-media key combinations. Comes with a full numeric keypad for a reliable connection and ultimate gaming performance. Widely Compatible: Automatically enter sleeping mode 10 minutes without operation and backlights off. Compatible with Windows 10, Windows 8, Windows 7, Windows XP, Windows VISTA, Mac OS, etc. User-friendly, quick control, no driver needed. ",
    "images": [
      "https://m.media-amazon.com/images/I/61w0BypBzrL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Shil6y2hL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/612eulnroxL._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/71QnU0W4vPL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Keyboards"]
  },
  {
    "name": "UBOTIE Colorful Bluetooth 100Keys Keyboards, Wireless Compact Rainbow Gradual Colors Retro Typewriter Flexible Keyboard for Tablet, Cellphones, PC (Purple-Colorful) ",
    "price": 39.99,
    "shippingCost": 6.0,
    "description": "【GORGEOUS GRADUAL COLORS & NEVER FADE OFF】This rainbow colors design keyboard will help you to enjoy your typing better and it could also help to to be distinctive in your office or dormitory. Also you will not worry the color will faded anymore from this 2021 new arrival version. 【RETRO ROUND KEYCAPS】Clicky, Classical, Memories, TKL, what we design is to help your could type something at anywhere, anytime, meanwhile, we hope this cute typewriter design keyboard could bring you some good memories. 【COMPATIBLE WITH WINDOWS & MAC OS & IOS & ANDROID】With this portable mini size bluetooth keyboards, you will find it is very convenient to type message or edict document by this portable keyboard on your cellphones or tablet pc. 【STABLE BLUETOOTH CONNECTION TECHNOLOGY】Broadcom Chip & 10m connecting rang & quickly re-connected &auto-sleep & energy saving. Please make sure that your device has bluetooth function or your just need a bluetooth receiver. 【ANY REPLACEMENT&REFUND WILL BE RESPONDED IN 6Hrs】Any problems please let us know in time and there will be a brand new one shipped to you. ",
    "images": [
      "https://m.media-amazon.com/images/I/61oDgVrphTL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/719six5DR5L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81sm10tzHBL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Keyboards"]
  },
  {
    "name": "HOTWEEMS D-09 Wireless Mouse for Laptop - Ergonomic Plus Computer USB Cordless Mice, Ergo Grips, Lightspeed 5-Level 2400 DPI, 16 Months Battery, Portable for PC Mac Chromebook, 6 Button, Stormy Black ",
    "price": 9.59,
    "shippingCost": 5.4,
    "description": "【Less Muscle Strain Ergonomics】Advanced ergonomic computer mouse provides total comfort with 30° ergonomic handshake angel, contoured grips and premium matte finish. 【Faster Wireless Transmission Speed】 33FT 2.4G wireless connection reduces all the interference and delays. Just plug the USB receiver into pc or laptop and your D-09 works instantly. 【3X Less Hand Movement】800-2400 DPI high precision sensor reduces muscle fatigue and boost your workflow. Cursor moves 3X faster than basic computer wireless mice. 【1 AA Battery, 2X Longer】Only 1 AA battery lasts up to 16 months. It enters sleep mode after you leave for 8 minutes. D-09 computer wireless mouse saves time and money by practically reducing the need to change batteries. 【Highly-Intergraded Body】Durable 50 Million clicks. Portable for travel use. Work with Windows laptop/MacBook/Chromebook/PC; Fast & easy 18 months replacement, please do not hesitate to let HOTWEEMS know. ",
    "images": [
      "https://m.media-amazon.com/images/I/61mmnjbOP0L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61+ODJu597L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71GNzkmkP9L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61y6PLhMh-L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CCx1hhZhL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Mouse"]
  },
  {
    "name": "seenda Wireless Mouse, 2.4G Noiseless Mouse with USB Receiver - Portable Computer Mice for PC, Tablet, Laptop with Windows System - Mint Green ",
    "price": 10.98,
    "shippingCost": 2.99,
    "description": "Wireless Mouse with More Color -- If you want a cute, colorful mouse, this should be the one. Also, the various color option and the compact size make it the best choice to help your kids work well on their E-Learning on their laptops.  Plug & Play Super Easy to Use -- Really plug & play design, no drivers need to be installed. 2.4GHz wireless transmission technology provides a powerful and reliable connection up to 33ft. Portable Size & Noiseless Mouse -- Portable design make it easy to store in bag for traveling, responsive buttons provides very soft click with less noise, no more disturbing for others with the loud clicking sound. Only 1 AA Battery is Required -- It takes only 1 AA Battery(NOT Included) to operate this mouse, and the wireless mouse will turn to sleep mode in 10mins of inactivity for energy saving, can be easily activated by clicking any buttons. PC Mouse with Universal Compatibility -- Work perfectly for Windows XP, Windows Vista, Windows 7, Mac OS X 10.4 etc. 【Pls Note: this mouse is connected by USB receiver, will NOT compatible with Macbook Pro or other devices which only have Type C ports】.",
    "images": [
      "https://m.media-amazon.com/images/I/61cWFgSqhFL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71f6CDsoM6L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61nhdMe6czL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61W35Ct5N8L._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Mouse"]
  },
  {
    "name": "Wired Gaming Mouse, PC Gaming Mice [Breathing RGB LED] [Plug Play] High-Precision Adjustable 7200 DPI, 7 Programmable Buttons, Ergonomic Computer USB Mouse for Windows/PC/Mac/Laptop Gamer ",
    "price": 14.59,
    "shippingCost": 19.64,
    "description": "【Charming Breathing RGB Backlight】16 million color options for the backlight setting make your gaming mouse looks fancy and cool. The RGB lights is much more vibrant than basic light up mice. You can turn off lights when unwanted. 【High-Precision DPI & Polling Rate】This gaming mouse runs flawlessly with competition-level optical sensor and avoids any random clicks. You can adjust DPI (500-7200) and polling rate(125-1000Hz) that provide precise cursor movements for daily tasks and various gameplay. 【7 Programmable Buttons, Simple Software】There are 7 buttons on the mouse that can be set for more intelligent functions such as RGB Controls/media control/rapid fire/macro etc. Software is initial and very easy to setup. Default functions of side buttons are forward/backward for efficiency surfing. 【Ergonomic Design, Less Fatigue】The ergonomic contour makes the PC gaming mice fit perfectly in any-size hands. Texture on the mouse is a super-fine rubber that feels comfortable and reduces your click fatigue during marathon multiplayer sessions. 【Plug & Play, Build Quality】As a plug-and-play wired pc mouse, it is easy to use and work with Windows/Mac OS/Linux/Chrome OS. You can feel the solid construction of all the buttons. They are responsive and won’t squeak or get stuck. Contact Lizsword for SOFTWARE.",
    "images": [
      "https://m.media-amazon.com/images/I/61LZk+r6FqL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81PNRr029gS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61FcCrVw-TL._AC_SL1280_.jpg",
      "https://m.media-amazon.com/images/I/712OvO7WkeL._AC_SL1280_.jpg",
      "https://m.media-amazon.com/images/I/71U-Rh7Uu2L._AC_SL1280_.jpg"
    ],
    "categories": ["Peripheral", "Mouse"]
  },
  {
    "name": "Logitech MX Master 2S Wireless Mouse – Use on Any Surface, Hyper-Fast Scrolling, Ergonomic Shape, Rechargeable, Control Upto 3 Apple Mac and Windows Computers, Graphite (Discontinued by Manufacturer) ",
    "price": 52.9,
    "shippingCost": 17.09,
    "description": "Cross computer control: Game changing capacity to navigate seamlessly on 3 computers, and copy paste text, images, and files from 1 to the other using Logitech flow. Dual connectivity: Use with upto 3 Windows or Mac computers via included Unifying receiver or Bluetooth Smart wireless technology. Gesture button- Yes. Advanced ergonomic design: Perfectly sculpted, hand crafted shape supports your hand and wrist in a comfortable, natural position. Auto shift scrolling: Speed adaptive scroll wheel auto shifts on the fly from click to click to hyper fast scrolling. Rechargable battery: Upto 70 days of power on a single charge.",
    "images": [
      "https://m.media-amazon.com/images/I/61lD2tTTi9L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61XaZ2Z2RUL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ftibAtvZL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/6156x2HeWBL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Mouse"]
  },
  {
    "name": "Webcam HD 1080p Web Camera, USB PC Computer Webcam with Microphone, Laptop Desktop Full HD Camera Video Webcam 110 Degree Widescreen, Pro Streaming Webcam for Recording, Calling, Conferencing, Gaming ",
    "price": 27.99,
    "shippingCost": 11.5,
    "description": "1080p full hd webcam, 1080p web camera specifically designed for professional quality video calling, recording, conferencing, gaming. computer camera with full hd glass lens deliver crisp image and crystal clear video at a fluid 30 frames per sec. equipped with automatic light correction and hdr technology, pro streaming webcam auto adjusts color and brightness for natural lighting so you always look your beautiful on web camera even in dim or poorly backlit. Easy to set up and tripod ready clip, usb webcam camera can be easily install and use, plug and play, no additional driver required. it also features a tripod ready adjustable universal clip with 1.8m 6 feet usb power cable that fits to laptops, desktops, computers, mac, pc, lcd monitors meet your multi angle needs. 110 degree widescreen webcam with mic,this camera built in digital stereo microphone with automatic noise reduction, which makes the sound purer and clearer, pick up your voice even at 10ft distance. fixed focus laptop desktop webcam captures high def video at a wide angle up to 110 degrees, perfect for live streaming, webinars, video conferencing, etc. Advanced technology and wide application, 1080p full hd camera with facial enhancement technology optimizes the image automatically, which makes you look great in recording, video calling, online teaching, gaming. pc webcam widely works with windows 2000, xp, 7, 8, 10 and above, mac os, chrome os, smart tv, android etc, compatible with skype, obs, youtube, facebook, twitch, facetime, zoom, xbox one, hangouts and more. Webcam with privacy cover and tripod stand , we will provide a privacy cover and tripod stand for you. pc webcam with privacy cover allows you to enjoy safe digital web life when not in use and prevent hackers from spying on you.to control what your video displays at any time, effectively protecting your privacy. the webcam comes with a tripod, convenient for you to place the computer camera.",
    "images": [
      "https://m.media-amazon.com/images/I/71c6VcE1DbL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71tcDHGK8fL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71kGK9isalS._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Cameras"]
  },
  {
    "name": "1080P Webcam with Microphone, eMeet C960 Web Camera, 2 Mics Streaming Webcam with Privacy Cover, 90°View Computer Camera, Plug&Play USB Webcam for Calls/Conference, Zoom/Skype/YouTube, Laptop/Desktop ",
    "price": 33.99,
    "shippingCost": 11.8,
    "description": "【Full HD 1080P Webcam with Privacy Cover for Video Calls】eMeet computer webcam provides design and Optimization for professional video streaming. Realistic 1920 x 1080p video, 4-layer anti-glare lens, providing smooth video. The fixed focal length makes the object in the focal length range of 1.97-197 inches, so as to provide a clearer image. the C960 usb webcam has a privacy cover and can be removed automatically to meet your needs for privacy protection,It is a great choice for home office. 【Built-in 2 Noise Reduction Mics】eMeet webcam with microphone for desktop is 2 built-in omnidirectional noise reduction microphones, picking up your voice and filtering out background noise to create an excellent radio effect. eMeet computer webcam enables you to enjoy crystal clear voice for hassle-free communication. (When installing the web camera, remember to select eMeet C960 usb webcam as the default device for the microphones). 【Low Dependence on Light Condition】Automatic low-light correction technology is applied in eMeet HD webcam 1080p so that the streaming webcam could capture the image in dim light. eMeet C960 camera for computer also has low-light boost, color boost and adjust exposure so you look your best, even in dim and harsh lighting. Imagine you are working in front of a sunny window. Is it convenient for no need to draw the curtains first when a video call comes in to get a normal exposure picture?. 【Plug-and-play & 90 Degrees Wide View】No driver required. eMeet C960 pc webcam can be used without drivers to realize plug and play for saving your trouble. The convenient foldable design of web camera allows you to take it anywhere, and the 70.87inch/ 1.8m USB cord is long enough for any task. The 90° wide-angle lens of USB camera can accommodate more participants. In video calls, there is no need to frequently adjust the direction of the web cam to show people in different positions. 【High Compatibility & Multi Application】 C960 webcam for laptop is compatible with Windows XP, Windows Vista, Windows 7/8/8.1/10, Mac 10.4 or later, Android Smart TV. The compatibility of the streaming camera is super wide for major software like Zoom, Facetime, Facebook, Skype, YouTube and more. Whether this web camera is used for online studying/ teaching, home office, conference, meeting or video calling, the web camera is perfectly suitable for you as a tripod-ready universal clip. ",
    "images": [
      "https://m.media-amazon.com/images/I/61-K2lXmHQL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61oSOPpGGGL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61GZUE2ZARL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/710y++r7-nL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Cameras"]
  },
  {
    "name": "Logitech C922x Pro Stream Webcam – Full 1080p HD Camera ",
    "price": 97.69,
    "shippingCost": 0,
    "description": "Web camera specifically designed and optimized for professional quality video streaming on social gaming and entertainment sites like Twitch and YouTube. Stream and record vibrant, true to life HD 1080P video at 30Fps/ 720P at 60FPS. Compatibility Windows 7, Windows 8 or Windows 10, macOS X 10.9 or higher, XBox One, Chrome OS, Android v5.0 or above, USB port. FoV: 78 degree. Full HD glass lens and premium autofocus deliver razor sharp, clear video in consistent high definition while 2 built in mics capture your voice in rich stereo audio. Record clear videos even in dim or poorly backlit settings with automatic light correction. Cable length: 5 feet. 1 - year limited warranty. ",
    "images": [
      "https://m.media-amazon.com/images/I/712xpaJPT6L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61AQYwSXuxL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-OBOi9PqL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Cameras"]
  },
  {
    "name": "Logitech C270 HD Webcam, HD 720p, Widescreen HD Video Calling, HD Light Correction, Noise-Reducing Mic, For Skype, FaceTime, Hangouts, WebEx, PC/Mac/Laptop/Macbook/Tablet - Black ",
    "price": 24.5,
    "shippingCost": 11.35,
    "description": "HD 720p video calling and HD video recording, 2.4 GigaHertz Intel Core2 Duo, 2 GB RAM,200 MB hard drive space. Video capture: Upto 1280 x 720 pixels, Logitech fluid crystal. Focus type: Fixed focus. Crisp 3 MP photos technology, Hi speed USB 2.0. Compatible with: Windows 10 or later, Windows 8, Windows 7, Works in USB video device class (UVC) mode with supported video calling clients: MacOS 10.10 or later, Chrome OS, Android v 5.0 or above. Built in microphone filters out background noise. System Requirements: Windows 7 Windows 8 or Windows 10 or later mac OS 10.10 or later chrome OSAndroid v 5.0 or above USB port Internet access visit your preferred video calling solution provider's website for exact information on system and performance requirements. Visit your preferred video calling solution provider's website for exact information on system and performance requirements. Works with Skype google hangouts face time for Mac.FoV: 60°. 2 years limited.",
    "images": [
      "https://m.media-amazon.com/images/I/61yo4swj-PL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71gtryrtsNL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61lcqzROexL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Cameras"]
  },
  {
    "name": "NexiGo N930AF Webcam with Software Control, Stereo Microphone and Privacy Cover, Autofocus, 1080p FHD USB Web Camera, Compatible with Zoom/Skype/Teams/Webex, PC Mac Desktop ",
    "price": 54.99,
    "shippingCost": 0,
    "description": "【FHD 1080P Autofocus Webcam】 The NexiGo N930AF Webcam features a two MP CMOS with up to 1080p resolution at 30fps. With a 7 cm starting point and amazing range, the autofocus feature is able to ensure your videos are always sharp and crystal clear. The autofocus can also be turned off to manually set your focal point if needed, unlike fixed focus cameras that require you to be within a specific distance. 【Webcam w/ Privacy Cover】 The privacy cover for the NexiGo N930AF covers the lens when it is not in use. This helps prevent criminals from accessing your webcam without your knowledge. It also helps to protect the lens from dirt and debris to ensure your video remains clear for the life of the camera. 【Built-in Microphone & Noise Cancellation】 The built-in noise-canceling microphone reduces ambient noise to enhance the sound quality of your video. Great for Zoom / Facetime / Video Calling / OBS / Twitch / Facebook / YouTube / Conferences / Gaming / Streaming / Recording / Online School. 【USB Webcam Plug and Play】 Works with USB 2.0, no additional drivers required. Ready to use in one minute or less with any compatible device. The convenient folding design allows you to easily take it anywhere, and the 6.5 ft (2 Meter) USB cord is long enough for any task. The mounting clip can be flexibly placed on any monitor / laptop / smart TV / tripod / or any flat surface. 【Widely Compatible & Multi Application】The NexiGo N930AF webcam is compatible with multiple operating systems, and can be used with almost all video meeting software. Compatible with Windows XP/7/8/10, Mac OS 10.6, Linux 2.6.24, Chrome OS 29.0.1547, Ubuntu Version 10.04 or above, and more.",
    "images": [
      "https://m.media-amazon.com/images/I/61BGZKR0OBL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/510Dm20+dNS._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/71N01GJqBGL._AC_SL1500_.jpg"
    ],
    "categories": ["Peripheral", "Cameras"]
  },
  {
    "name": "SAMSUNG 980 SSD 1TB M.2 NVMe Interface Internal Solid State Drive with V-NAND Technology for Gaming, Heavy Graphics, Full Power Mode, MZ-V8V1T0B/AM",
    "price": 99.99,
    "shippingCost": 42.47,
    "description": "UPGRADE TO IMPRESSIVE NVMe SPEED Whether you need a boost for gaming or a seamless workflow for heavy graphics, the 980 is a smart choice for outstanding SSD performance. PACKED WITH SPEED 980 delivers value, without sacrificing sequential read write speeds up to 3,500 3,000 MB s. PACKED WITH SPEED 980 delivers value, without sacrificing sequential read write speeds up to 3,500 3,000 MB s. BUILT FOR THE LONG RUN With up to 600 TBW and the 980's optimized endurance comes with trusted reliability.",
    "images": [
      "https://m.media-amazon.com/images/I/714VYiAYssL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/81YQPGH61mL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/812opUOuMzL._AC_SX679_.jpg"
    ],
    "categories": ["SSD", "Components", "Gaming"]
  },
  {
    "name": "Crucial BX500 2TB 3D NAND SATA 2.5-Inch Internal SSD, up to 540MB/s - CT2000BX500SSD1",
    "price": 159.99,
    "shippingCost": 35.72,
    "description": "Boot up faster. Load files quicker. Improve overall system responsiveness. 300% faster than a typical hard drive. Improves battery life because it’s 45x more energy efficient than a typical hard drive. Micron 3D NAND – advancing the world's memory and storage technology for 40 years. Crucial 3-year limited warranty.",
    "images": [
      "https://m.media-amazon.com/images/I/61dPLkN4poL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/516GLf2owML._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/61MOAo9OF2L._AC_SX679_.jpg"
    ],
    "categories": ["SSD", "Components", "Gaming"]
  },
  {
    "name": "Kingston 120GB A400 SATA 3 2.5 Internal SSD SA400S37/120G - HDD Replacement for Increase Performance , Black",
    "price": 29.04,
    "shippingCost": 42.19,
    "description": "Fast start up, loading and file transfers. Fast start up, loading and file transfers. Multiple capacities with space for applications or a hard drive replacement. SSD must be initialized and formatted to enable host computer and applications to access the drive. Use Windows Disk Management tool, or MacOS Disk Utility app, or Linux compatible disk partition utility to initialize and format new SSD. Fresh install operating system from distribution media to SSD, or use data cloning software to migrate data from source drive to SSD.",
    "images": [
      "https://m.media-amazon.com/images/I/81Ey1ozqOAL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/91CLm+jOmWL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/210UVB9zL0L._AC_.jpg"
    ],
    "categories": ["SSD", "Components"]
  },
  {
    "name": "Kingston 480GB A400 SATA 3 2.5 Internal SSD SA400S37/480G - HDD Replacement for Increase Performance",
    "price": 54.99,
    "shippingCost": 34.57,
    "description": "Fast start up, loading and file transfers. A400 has a 7 millimeter form factor to fit in a wider array of systems. It’s ideal for slimmer notebooks and in systems with limited available space. More reliable and durable than a hard drive. Multiple capacities with space for applications or a hard drive replacement; Operating temperature: 0°C-70°C. Capacity: 480GB, Interface: SATA Rev. 3.0 (6Gb/s) with backwards compatibility to SATA Rev. 2.0. 480GB to 500MB/s Read and 450MB/s Write.",
    "images": [
      "https://m.media-amazon.com/images/I/91RL+MhTWbL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/81vCejH6FxL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/21ys6wDn1NL._AC_.jpg"
    ],
    "categories": ["SSD", "Components"]
  },
  {
    "name": "SanDisk 1TB Extreme Portable SSD - Up to 1050MB/s - USB-C, USB 3.2 Gen 2 - External Solid State Drive - SDSSDE61-1T00-G25",
    "price": 134.0,
    "shippingCost": 30,
    "description": "Get NVMe solid state performance featuring up to 1050MB/s read and up to 1000MB/s write speeds in a portable, high-capacity drive that’s perfect for creating amazing content or capturing incredible footage. Requires compatible devices capable of reaching such speed. Based on internal testing; Performance may be lower depending on host device, interface, usage conditions and other factors. 1MB=1,000,000 bytes. Up to 2 meter drop protection and IP55 water and dust resistance (3) mean this tough drive can take a beating. Use the handy Carabiner loop to secure it to your belt loop or backpack for extra peace of mind. Help keep private content private with the included password protection featuring 256‐bit AES hardware encryption (2). Back up mobile content quickly and easily thanks to compatibility with a range of USB Type-C smart phones. From SanDisk, the brand professional photographers worldwide trust to handle their best shots and footage.",
    "images": [
      "https://m.media-amazon.com/images/I/712+jjz3lyL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/A15nymkfBZL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/81Ek8ekLOXL._AC_SX679_.jpg"
    ],
    "categories": ["SSD", "Components"]
  },
  {
    "name": "WD 5TB Elements Portable External Hard Drive HDD, USB 3.0, Compatible with PC, Mac, PS4 & Xbox - WDBU6Y0050BBK-WESN",
    "price": 104.99,
    "shippingCost": 32,
    "description": "USB 3.0 and USB 2.0 compatibility. Compatible with PC, Mac, PS4 and Xbox. Fast data transfers, improves PC performance. High capacity Memory storage capacity: 5TB.",
    "images": [
      "https://m.media-amazon.com/images/I/91mlqrT75WL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71Rhb-i5qtL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/816Cyv4kf0L._AC_SX679_.jpg"
    ],
    "categories": ["HDD", "Components"]
  },
  {
    "name": "Seagate BarraCuda 2TB Internal Hard Drive HDD – 3.5 Inch SATA 6Gb/s 7200 RPM 256MB Cache 3.5-Inch – Frustration Free Packaging (ST2000DM008/ST2000DMZ08)",
    "price": 46.99,
    "shippingCost": 41.97,
    "description": "Easily store and access 2TB to content on the go with the Seagate Portable Drive, a USB external hard drive. Designed to work with Windows or Mac computers, this external hard drive makes backup a snap just drag and drop. To get set up, connect the portable hard drive to a computer for automatic recognition no software required. This USB drive provides plug and play simplicity with the included 18 inch USB 3.0 cable.",
    "images": [
      "https://m.media-amazon.com/images/I/71Czt9ypIbL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/61-uixfTqZL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71XFaoMUMWL._AC_SX679_.jpg"
    ],
    "categories": ["HDD", "Components"]
  },
  {
    "name": "Seagate Portable 2TB External Hard Drive Portable HDD – USB 3.0 for PC, Mac, PlayStation, & Xbox - 1-Year Rescue Service (STGX2000400)",
    "price": 59.99,
    "shippingCost": 13.45,
    "description": "Easily store and access 2TB to content on the go with the Seagate Portable Drive, a USB external hard drive. Designed to work with Windows or Mac computers, this external hard drive makes backup a snap just drag and drop. To get set up, connect the portable hard drive to a computer for automatic recognition no software required. This USB drive provides plug and play simplicity with the included 18 inch USB 3.0 cable.",
    "images": [
      "https://m.media-amazon.com/images/I/81tjLksKixL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/91QqR55XhQL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/918-cGeMaRL._AC_SX679_.jpg"
    ],
    "categories": ["HDD", "Components"]
  },
  {
    "name": "Western Digital 2TB WD Blue PC Hard Drive - 7200 RPM Class, SATA 6 Gb/s, 256 MB Cache, 3.5 - WD20EZBX",
    "price": 46.99,
    "shippingCost": 23.45,
    "description": "Reliable everyday computing. Western Digital quality and reliability. Free Acronis True Image WD Edition cloning software. Massive capacity up to 6TB*. 2-year limited warranty.",
    "images": [
      "https://m.media-amazon.com/images/I/71tsQqsqD7S._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/81cdQuJqKjS._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/91QZGnfvyWS._AC_SX679_.jpg"
    ],
    "categories": ["HDD", "Components"]
  },
  {
    "name": "Seagate IronWolf 4TB NAS Internal Hard Drive HDD – CMR 3.5 Inch SATA 6Gb/s 5900 RPM 64MB Cache for RAID Network Attached Storage – Frustration Free Packaging (ST4000VN008)",
    "price": 79.99,
    "shippingCost": 43.0,
    "description": "IronWolf internal hard drives are the ideal solution for up to 8 bay, multi user NAS environments craving powerhouse performance. Store more and work faster with a NAS optimized hard drive providing 4TB and cache of up to 64MB. Purpose built for NAS enclosures, IronWolf delivers less wear and tear, little to no noise/vibration, no lags or down time, increased file sharing performance, and much more. Easily monitor the health of drives using the integrated IronWolf Health Management system and enjoy long term reliability with 1M hours MTBF.",
    "images": [
      "https://m.media-amazon.com/images/I/811hUZ6znwL._AC_SX466_.jpg",
      "https://m.media-amazon.com/images/I/71hN-+qDgpL._AC_SX466_.jpg",
      "https://m.media-amazon.com/images/I/71BdBVQiLRL._AC_SX466_.jpg"
    ],
    "categories": ["HDD", "Components"]
  },
  {
    "name": "HP LaserJet Pro M404dn Auto Duplex Monochrome Laser Printer",
    "price": 369.0,
    "shippingCost": 55.78,
    "description": "Model #: W1A53A (Replaces m402dn C5F94A / m402dne C5J91A). Print up to 40 ppm Auto Duplex Printing HP FastRes1200 (Enhanced up to 4800 x 600 dpi) Black Print Quality. Gigabit Ethernet 10/100/1000BASE-T network Up to 80,000 pages monthly. 256 MB DRAM; 256 MB Flash Memory, Uses HP 58A Standard Yield (CF258A) or 58X High Yield (CF258X) Black Original LaserJet Toner Cartridges",
    "images": [
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-413-593-V80.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-413-593-V03.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-413-593-V04.jpg"
    ],
    "categories": ["Printers", "Laser Printers"]
  },
  {
    "name": "Canon imageCLASS LBP6230dw wireless Monochrome laser printer with Duplex printing, 26 ppm",
    "price": 161.24,
    "shippingCost": 161.24,
    "description": "Monochrome Laserjet. Single function. Up to 26 ppm. Up to 600 x 600 dpi. USB 2.0, Ethernet, Wireless. Duplex Printing. Compatible toner: Cartridge 126 Black (3483B001)",
    "images": [
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-143-081-04.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-143-081-01.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-143-081-02.jpg"
    ],
    "categories": ["Printers", "Laser Printers"]
  },
  {
    "name": "Xerox B310 Printer, Up To 42 ppm, Letter/Legal, USB/Ethernet And Wireless, 250-Sheet Tray, Automatic 2-Sided Printing, 110V",
    "price": 379.99,
    "shippingCost": 55.78,
    "description": "Print Only. Up to 42 ppm. 600 x 600 dpi Black Print Quality. Ethernet 10/100BaseTX (RJ-45). Up to 80,000 pages monthly. 256 MB Memory, std.",
    "images": [
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-116-996-S02.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-116-996-S04.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-116-996-S03.jpg"
    ],
    "categories": ["Printers", "Laser Printers"]
  },
  {
    "name": "Okidata C331dn (62443601) Up to 25 ppm 1200 x 600 dpi USB/Ethernet Color Duplex Laser Printer",
    "price": 499.99,
    "shippingCost": 65.72,
    "description": "Up to 25 ppm. Up to 1200 x 600 dpi. USB and Ethernet Compatible. 350 Pages Paper Capacity. Duplex Printing",
    "images": [
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-107-684-04.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-107-684-05.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-107-684-10.jpg"
    ],
    "categories": ["Printers", "Laser Printers"]
  },
  {
    "name": "HP DeskJet 2755e All-in-One Wireless Color Printer, with bonus 6 months free Instant Ink with HP+ (26K67A)",
    "price": 79.99,
    "shippingCost": 10.55,
    "description": "BEST FOR BASIC PRINTING - Print basic color documents like recipes, forms and travel documents.. KEY FEATURES - Print, copy and scan in color, plus mobile and wireless printing.. ACTIVATE HP+ AND INSTANT INK AT PRINTER SETUP - Once HP+ is activated, your printer must be connected to the internet and requires Original HP Ink Cartridges to operate for the life of the printer. HP SMART APP - Print, copy and scan from your phone-from anywhere. EASY SETUP - Get started fast with easy printer setup that guides you step by step. WORRY-FREE WIRELESS - Get better range and more reliable connections using dual-band Wi-Fi with self-reset.",
    "images": [
      "https://c1.neweggimages.com/ProductImageCompressAll1280/1E4-0015-00AD5-V01.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/1E4-0015-00AD5-V05.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/1E4-0015-00AD5-V02.jpg"
    ],
    "categories": ["Printers", "Deskjet Printers"]
  },
  {
    "name": "Epson WorkForce WF-2860 All-in-One Wireless Color Printer with Scanner, Copier, Fax, Ethernet, Wi-Fi Direct and NFC",
    "price": 149.99,
    "shippingCost": 22.56,
    "description": "4-in-1 with Wireless, NFC & Ethernet: Print/Copy/Scan/Fax. Powered by PrecisionCore - Laser-Quality Performance. Packed with features; space-saving design. 150-sheet capacity; 30-pg ADF; auto 2-sided printing. 2.4 color touchscreen - easy setup and navigation. Easy smartphone/tablet printing, plus NFC. Designed for use exclusively with Epson cartridges",
    "images": [
      "https://c1.neweggimages.com/ProductImageCompressAll1280/1E4-000F-007R8-V09.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/1E4-000F-007R8-V15.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/1E4-000F-007R8-V12.jpg"
    ],
    "categories": ["Printers", "Deskjet Printers"]
  },
  {
    "name": "Canon PIXMA TS3420 Wireless Inkjet All-In-One Printer - Black/White",
    "price": 135.99,
    "shippingCost": 9.78,
    "description": "Printing up to 4,800 dpi x 1,200 dpi as maximum printing resolution. All-in-One Inkjet Color Printer. Flatbed scanner allows scanning items up to A4/Letter size at 600 dpi x 1,200 dpi optical resolution. Black Print Quality of up to Up to 4800 x 1200 dpi. Color Print Quality of up to Up to 4800 x 1200 dpi. Ability to print documents or photos directly from any compatible smartphone (using the Canon PRINT Inkjet/SELPHY app) via Wi-Fi connection. Using a 4-colour Hybrid Ink system, print at a speed of approx. 7.7 images per minute (ipm) in black ink and 4 ipm in color. 6.5 seconds to first page",
    "images": [
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-143-739-S01.jpg",
      "https://c1.neweggimages.com/ProductImageCompressAll1280/28-143-739-S02.jpg"
    ],
    "categories": ["Printers", "Deskjet Printers"]
  },
  {
    "name": "Samsung Galaxy Tab A8 Android Tablet, 10.5” LCD Screen, 32GB Storage, Long-Lasting Battery, Samsung Electronics Kids Content, Smart Switch, Expandable Memory, Dark Gray ",
    "price": 199.99,
    "shippingCost": 0,
    "description": "A Screen Everyone Will Love: Whether your family is streaming or video chatting with friends, the Galaxy Tab A8 tablet brings out the best in every moment on a 10.5' LCD screen. Power and Storage for All: Get the power, storage and speed your family needs with an upgraded chipset and plenty of room to keep files — up to 128GB of storage; A long-lasting battery lets you go unplugged for hours to keep the family fun going. Charge Fast, Power for Hours: Go for hours on a single charge* and back to 100% with the fast charging USB C port; *Battery life may vary depending on network environment, usage patterns and other factors. Galaxy Ecosystem Experience: Open up a new world of convenient possibilities with the Galaxy ecosystem experience — your devices, including your phone, laptop computer, and tablet, all automatically talk to one another seamlessly. Your Notes, All in One Place: Do more with your notes with Galaxy connectivity that automatically syncs everything from to-do lists to school work, whether you’re on your tablet, phone or watch. Kids Digital Learning: Children can enjoy access to Samsung Kids, a library of safe and fun games, books and videos that are kid friendly and parent approved. Easiest. Transfer. Ever: No matter what operating system you're using, Smart Switch makes it a breeze to move your data and favorite files in three easy steps.",
    "images": [
      "https://m.media-amazon.com/images/I/61krikJxTmL._AC_SL1200_.jpg",
      "https://m.media-amazon.com/images/I/41QdDck4jUL._AC_SL1200_.jpg",
      "https://m.media-amazon.com/images/I/41PhC59EGJL._AC_SL1500_.jpg"
    ],
    "categories": ["Tablets"]
  },
  {
    "name": "Tablet 10 inch Android Tablet, Android 10.0 Tablet Quad-Core Processor 32GB Storage Tablet Computer, 2GB RAM, 8MP Camera, Long Battery Life (Black) ",
    "price": 89.99,
    "shippingCost": 0,
    "description": "【Excellent Performance】---This Google Tablet CP10 Featuring with Powerful Quad-core SC7731E, 1.3 GHz CPU, 2GB RAM and Newest Android 10.0 Operating System. Ensure Faster and more Responsive Using Experience for Quick APP Launches, Smooth Light Games and Videos. 【Great View and More Responsive】---This 10'' Tablet Pad Adopts a 1280 x 800 IPS HD Display, Presenting a Bright Display with Vivid Colors for a more True-to-life Viewing experience, Brings you a Crisper and Brighter image. Featuring with 10.0' Capacitive touch, Five point cap-touch G+G, Ensure a more Fluently Action for Movie and Game. 【More Functional】---Front 2.0 Mega pixel, Back 8.0 Mega pixel camera with Flash Light, Support Bluetooth, Built-in GPS, 32GB Storage, 1080P Videos. Meets Reading, Photograph, videos, Music, etc. Suitable for Most Life Scenarios. 【Long-Life Battery】---Equipped with a 6000mAh Built-in Rechargeable Battery, Enables about 8 Hours Mixed-use when Travelling. Read e-Books, Listen to Music, Watch a Movie, Play a Game, or Surf the Internet, This tablet will be a Perfect Choice. 【2.4G WIFI Connect】---Kindly Note: this is a WIFI tablet, NOT Support the SIM Card. 2021 Newest Tablet Computer Stay Connected with Built-in Bluetooth 4.0 and Wi-Fi 802.11 ac/b/g/n. Perfect for Fast Connecting Network. ",
    "images": [
      "https://m.media-amazon.com/images/I/61ZHdekAGAS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/614JikH42eL._AC_SL1250_.jpg",
      "https://m.media-amazon.com/images/I/61iEFp+-SGS._AC_SL1250_.jpg",
      "https://m.media-amazon.com/images/I/61EJn4P55RL._AC_SL1500_.jpg"
    ],
    "categories": ["Tablets"]
  },
  {
    "name": "Lenovo Tab M8 Tablet, HD Android Tablet, Quad-Core Processor, 2GHz, 32GB Storage, Full Metal Cover, Long Battery Life, Android 9 Pie, Slate Black ",
    "price": 99.99,
    "shippingCost": 0,
    "description": "Stunning performance and stylish design combine in this quick, powerful Android tablet, powered by a Quad-Core, 2.0 GHz processor and Android 9 Pie. The modern, refined look and feel are accentuated by the full metal cover and 82% panel-to-body ratio. The stunning 8' HD (1280 x 800) display brings you a crisper and brighter image, so you can watch your favorite movies and shows without missing a detail. Stay connected with built-in Bluetooth 5.0 and Wi-Fi 802.11 a/b/g/n/ac (2.4/5 GHz), and capture the moment with front and rear cameras. Long-life battery – Watch or browse all day long without the need to recharge with 5000 mAh battery capacity.",
    "images": [
      "https://m.media-amazon.com/images/I/61o0EbhjKDL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51w2z+1zxML._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61DZ8HmaKsL._AC_SL1500_.jpg"
    ],
    "categories": ["Tablets"]
  },
  {
    "name": "Tablet 10 inch Android 11 Octa-Core Processor Dual Sim Cellular 4G LTE Tablet PC 4GB RAM 64GB ROM 128GB Expandable, Google Certified Tablet with Keyboard 13 MP Camera Bluetooth WiFi GPS ",
    "price": 159.99,
    "shippingCost": 0,
    "description": "【Multifunctional 4G LTE Phone Tablet with Multiple Accessories】 Android 11.0 tablet with pen mouse keyboard and more, support 4G network/cellular network and WIFI, make the tablet both a smartphone and a tablet. You can make phone calls and surf the internet anywhere, 10 inch tablet with GPS, Bluetooth 5.0, FM, OTG and WiFi. With Google Play pre-installed, you can download apps like Facebook, Twitter, Instagram, and more. 【4 GB RAM + 64 GB ROM + 128 GB Expandable + Octa-Core】2 in 1 Android tablet with 4 GB RAM, 64 GB ROM. large storage space for your daily entertainment and work needs. For example, keep games, videos, songs, eBooks, photos and important files. With the updated Android 11 with octa-core processor, you can enjoy a user-friendly experience. 【13 MP Rear Camera + 5 MP HD Front Camera + 1280*800 IPS Full HD Screen】10.1 inch Tablet with 13 MP rear camera and 5 MP front camera. With dual front and rear cameras, you can capture every beautiful moment in your life and take photos and videos. 1280x800 IPS HD display restores images to their original colors, allowing you to watch 1080P Full HD videos and movies more clearly. 【6000mAh Large Battery + Latest Android 11.0 OS】MEIZE tablet uses 6000mAh battery. Tablet Android 6580mAh large battery can be used for days. (408 hours of standby, 20 hours of talk, 28 hours of MP3 music, 8 hours of online video) Never worry about losing contact with your friends again! . 【Lifetime Customer Service】 We provide lifetime technical support and 1 year warranty. If you encounter any problem during use, please contact us immediately and we will solve your problem as soon as possible.",
    "images": [
      "https://m.media-amazon.com/images/I/71TQ8dkHZ3L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71PQ5npYFfL._AC_SL1200_.jpg",
      "https://m.media-amazon.com/images/I/71c1E5zpRbL._AC_SL1200_.jpg"
    ],
    "categories": ["Tablets"]
  },
  {
    "name": "Tablet Android Tablet 10.1 inch 32GB ROM 2GB RAM Tablets 6000mAh Battery Quad Core HD Touchscreen Tablets PC Black ",
    "price": 79.99,
    "shippingCost": 0,
    "description": "[Good Performance] Tablet adopt Android 10.0 operating system, 2GB RAM and 32GB ROM. Powerful Quad-core Processer ensure Faster and more Responsive Using Experience. [Good View Display] Computer Tablet adopt a 1280*800 HD IPS display with vivid colors and an improved viewing angle. Can Present a sharper hierarchy of images and richer colors for a more true-to-life viewing experience. [Support More Storage] This 10.1 inch Tablets have 32GB ROM Storage can expanded to 128GB biggest 512GB Micro SD Card (Card not included). Can place more for your favorite video, Musics, ebooks, photos etc. [Multi Function] Tablet use Front 2.0MP, Back 8.0MP Camera. Bluetooth 4.0, Built-in GPS, 32GB Storage, 6000mAh Big Battery. Enables about 8 Hours Mixed-use when Travelling. Better for Read e-Books, Listen to Music, Watch a Movie. [Good Gift Choice] This 10 inch Tablet with durable materail and fashion design. Lightweight, suitable size, it is a better present choice for family, friends and kids. We provide return and exchange service. Any qustions, please contact us freely. ",
    "images": [
      "https://m.media-amazon.com/images/I/71oXKxXxS9L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71tN5IEPsLL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71m8f0YtNXL._AC_SL1500_.jpg"
    ],
    "categories": ["Tablets"]
  },
  {
    "name": "HP M27ha FHD Monitor - Full HD Monitor (1920 x 1080p) - IPS Panel and Built-in Audio - VESA Compatible 27-inch Monitor Designed for Comfortable Viewing with Height and Pivot Adjustment - (22H94AA#ABA) ",
    "price": 217.0,
    "shippingCost": 35.16,
    "description": "OPTIMIZED SCREEN – Get high-quality pictures on a full HD display with an IPS panel and 27-inches of ultra-wide viewing angles (1920 x 1080 resolution). EASY ON THE EYES – Work long into the night without any eye strain with HP Low Blue Light software designed for greater eye comfort. ADJUSTABLE VIEWING – Find your best view as the 3-sided micro-edge bezel display gives you unlimited sightlines, 100mm of height adjustment, and 90° pivot rotation. FULLY INTEGRATED AUDIO – Enjoy all your multimedia with a monitor that has convenient stereo audio right on the display. VESA COMPATIBILITY – The 100mm VESA pattern gives you plenty of options for mounting your monitor on whatever wall or desk suits your fancy. PORTS-A-PLENTY – Link up all your devices for a seamless multi-display setup with HDMI, DisplayPort, and VGA ports as well as an audio input. WARRANTY – Enjoy a one-year limited warranty.",
    "images": [
      "https://m.media-amazon.com/images/I/818NZ0C5z+L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81BYS2AnsXL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/816rcYLpjfL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Qs7usWrNL._AC_SL1500_.jpg"
    ],
    "categories": ["Monitors"]
  },
  {
    "name": "HP V223ve FHD Monitor, 1080p VA Display,75Hz Refresh Rate, 21.5-inch Computer Screen,TÜV certified Low Blue Light Mode, Ergonomic Tilt,3000:1 Contrast Ratio,HDMI & VGA Ports,VESA Mounting (2021),Black ",
    "price": 143.0,
    "shippingCost": 36.38,
    "description": "AN EVERYDAY MONITOR – Answer emails, check your social feeds, and watch the latest shows on a tilt-adjustable monitor that delivers stunning picture quality in a highly affordable style. FULL HD DISPLAY – Be prepared for brilliant visuals on this 21.5-inch Full HD display (1); enjoy colors that pop and superb black levels thanks to its 75Hz refresh rate, a contrast ratio of 3000:1, and a dynamic contrast ratio of 5M:1 (2). SHARE THE PANORAMIC VIEW – Get vibrant detail from practically any position with wide, 178-degree viewing angles on a VA panel. MODERN CONNECTIVITY – Easily connect additional devices, storage drives, or monitors through the HDMI and VGA ports. EASY ON THE EYES – The TÜV certified Low Blue Light Mode subtly shifts your display’s colors to a warmer spectrum while making whites more natural for greater comfort and less eye strain. ERGONOMIC ADJUST – Find your best viewing position and stay comfortable during your next binge-watch or marathon project by tilting the screen up to 5 degrees forward or 22 degrees backward. NARROW BEZEL DESIGN – Optimized for both looks and efficiency, your monitor's narrow bezel lets you enjoy more of your screen. ",
    "images": [
      "https://m.media-amazon.com/images/I/61+R6lkowKL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71-KkiTl2hL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71sEQIe3gqL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Bn+V+eKrL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71vYm6NclRL._AC_SL1500_.jpg"
    ],
    "categories": ["Monitors"]
  },
  {
    "name": "SAMSUNG 23.5” CF396 Curved Computer Monitor, AMD FreeSync for Advanced Gaming, 4ms Response Time, Wide Viewing Angle, Ultra Slim Design, LC24F396FHNXZA, Black ",
    "price": 169.99,
    "shippingCost": 39.07,
    "description": "Immersive Viewing Experience: The 1800R curvature of the screen lets you enjoy big, bold and stunning panoramic views while you work or play at home or the office. Super Slim Design: Make a stylish statement with its ultra-slim and sleek profile; Monitor measures less than 0.5 inch thick and the simple circular stand adds a modern look to your space. Advanced Gaming w/ AMD FreeSync: This technology allows users to enjoy smooth images, even during the fastest moving scenes; It minimizes input latency, dramatically reduces image tearing and stutter. Fast 4ms Response Time: With its 4ms response rate, you'll see the fastest on-screen motion clearly and smoothly with less blur, judder, and ghosting, allowing players to experience their games at the highest level. Eye Saver Mode: Optimize your viewing comfort by reducing blue light emissions and flickers at the touch of a button; Read documents, play games, watch movies and edit photos for longer periods without worrying about eye strain or fatigue. Brilliant Picture Quality: Experience vibrant, vivid colors with Samsung's Active Crystal Color technology; The excellent 3000:1 contrast ratio delivers deep blacks and bright whites so you can see clearly even in the darkest or brightest scenes. Eco-Saving Plus: This feature reduces screen brightness to save power, plus the screen brightness automatically transitions fluidly—reducing energy use even more. Connectivity technology: HDMI.",
    "images": [
      "https://m.media-amazon.com/images/I/91ubktnbNVL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71VyDtO1TCL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61Jo9aH-8OL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81fdPSv2CDL._AC_SL1500_.jpg"
    ],
    "categories": ["Monitors"]
  },
  {
    "name": "Sceptre Curved 24' 75Hz Professional LED Monitor 1080p 98% sRGB HDMI VGA Build-in Speakers, Machine Black 2021",
    "price": 204.0,
    "shippingCost": 43.98,
    "description": "Anti-Flicker Provides a crisper picture by preventing the backlight from flickering periodically. Multiple Ports Connect video and audio your way with HDMI and VGA Port, and Audio Jack inputs all available. Tilt With the ability to tilt 15 degrees backward and 5 degrees forward, the added tilt feature will provide multiple options for finding the optimum angle to view the screen so that work and browsing can be performed with ease. 75Hz Refresh Rate More than the standard refresh rate, 75Hz gives gamers an edge in visibility as frames transition instantly, leaving behind no blurred images. Curve Monitor The curved display delivers a revolutionary visual experience with a leading 1800R screen curvature as the images appear to wrap around you for an in depth, immersive experience. ",
    "images": [
      "https://m.media-amazon.com/images/I/81SoE0g+uqL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61MIofFA1yL._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/61HbecFd+bL._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/51Tu8AGh+9L._AC_SL1000_.jpg"
    ],
    "categories": ["Monitors"]
  },
  {
    "name": "Dell SE2422HX - 23.8-inch FHD (1920 x 1080) 16:9 Monitor with Comfortview (TUV-Certified), 75Hz Refresh Rate, 16.7 Million Colors, Anti-Glare with 3H Hardness, Black",
    "price": 218.99,
    "shippingCost": 49.48,
    "description": "23.8-inch Full HD monitors featuring three-sided slim bezels and a compact footprint. Minimize harmful blue light emissions to help reduce eye fatigue with Dell’s TUVcertified Comfort View feature. A built-in power supply unit and cable holder help to further reduce clutter. Save energy when your monitor is not in use with PowerNap. Eco-conscious packaging, this monitor is shipped Styrofoam-free. ",
    "images": [
      "https://m.media-amazon.com/images/I/81skFI+vYiS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41aflYtK1nS._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51ay9+kRKbS._AC_SL1500_.jpg"
    ],
    "categories": ["Monitors"]
  },
  {
    "name": "Acer Aspire 5 A515-46-R3UB | 15.6' Full HD IPS Display | AMD Ryzen 3 3350U Quad-Core Mobile Processor | 4GB DDR4 | 128GB NVMe SSD | WiFi 6 | Backlit KB | FPR | Amazon Alexa | Windows 11 Home in S mode",
    "price": 369.99,
    "shippingCost": 0,
    "description": "Powerful Productivity: AMD Ryzen 3 3350U delivers desktop-class performance and amazing battery life in a slim notebook. With Precision Boost, get up to 3.5GHz for your high-demand applications. Maximized Visuals: See even more on the stunning 15.6' Full HD display with 82.58% screen-to-body, 16:9 aspect ratio and narrow bezels. Backlit Keyboard and Fingerprint Reader: Biometric fingerprint reader and Windows Hello sign-in options help keep your Acer PC secure. Internal Specifications: 4GB DDR4 on-board memory (1 slot available); 128GB NVMe solid-state drive storage (1 hard drive bay available) to store your files and media. Acer's Purified.Voice technology, features enhanced digital signal processing to cancel out background noise, improve speech accuracy and far-field pickup, which not only makes calls clearer, but makes talking to Alexa easier than before. With Alexa Show Mode, you can use your PC as a full-screen interactive experience that features rich visuals and lets you talk to Alexa from across the room. Secure Operating System: Windows 11 Home in S mode comes with advanced security features built right in, like protections against phishing and malicious software so you don't have to think twice when navigating to a new webpage or downloading an app.",
    "images": [
      "https://m.media-amazon.com/images/I/7189iXimfWL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71J7ScSjhlL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717-6cnCAmL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81hf1300BkL._AC_SL1500_.jpg"
    ],
    "categories": ["Laptops", "Computers"]
  },
  {
    "name": "Lenovo Flex 5 Laptop, 14.0' FHD Touch Display, AMD Ryzen 5 5500U, 16GB RAM, 256GB Storage, AMD Radeon Graphics, Windows 11 Home ",
    "price": 599.99,
    "shippingCost": 20.26,
    "description": "Powered by an AMD Ryzen 5 5500U mobile processor with Radeon graphics, this portable notebook computer has 16GB DDR4 RAM and 256GB NVMe SSD Storage. Reduce the clutter - The Flex 5 14 touchscreen laptop has a narrow bezel on 4 sides for more viewing area and less clutter on the IPS FHD (1920 x 1080) display. Designed to keep your ideas flowing, anywhere, anytime with the ability to multi-mode, this Windows laptop has a 360⁰ hinge so you can use it in laptop mode for everyday computing, tent mode for sharing, stand mode for binge-watching your favorite streaming shows, or tablet mode for easy interaction. A physical shutter on the webcam improves your privacy, allowing you to keep out unwanted attention. Stay connected with integrated 2x2 WiFi 6 (802.11AX), Bluetooth 5, 2 USB-A ports, 1 USB-C with PD to support power charging, HDMI, a 4-in-1 card reader, and an audio jack. Includes free 3-month trial of Xbox Game Pass Ultimate - Play over 100 high-quality PC games on Windows PC; includes iconic Bethesda games, new day one titles, and the EA Play on PC catalog.",
    "images": [
      "https://m.media-amazon.com/images/I/71zZiQGzc5L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/818B97p+vcL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71WcP2tg9BL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71k58VtLUXL._AC_SL1500_.jpg"
    ],
    "categories": ["Laptops", "Computers"]
  },
  {
    "name": "2022 Newest HP 15.6' HD Laptop Computer, 11th Gen Intel Quad-Core i3-1125G4(Up to 3.7GHz, Beat i5-10210U), 8GB RAM, 128GB SSD, Webcam, Bluetooth, Wi-Fi, HDMI, USB-C, Windows 11 S, Silver+JVQ Mousepad ",
    "price": 437.99,
    "shippingCost": 29.11,
    "description": "【15.6 HD Display】15.6' diagonal, HD (1366 x 768), micro-edge, anti-glare, 250 nits, 45% NTSC. 【11th Gen Intel Quad Core i3 CPU】Intel Core i3-1125G4 (up to 3.7 GHz with Intel Turbo Boost Technology, 8 MB L3 cache, 4 cores, 8 threads), Beats Intel i5-10210U. 【Fast Speed and Enormous Space】RAM is upgraded to 8GB memory for better multitasking. Hard Drive is upgrade to 128GB SSD which has faster data access speed, better performance and greater reliability. 【Connectivity and Security Features】1 x USB Type-C, 2 x USB 3.1, 1 x HDMI, 1 x Headphone+Mic Combo Jack, 1 x Multi-Format SD Media Card Reader. 【Windows 11】Windows 11 Home in S Model, 64-bit, English.",
    "images": [
      "https://m.media-amazon.com/images/I/41S-wuJXCOL._AC_.jpg",
      "https://m.media-amazon.com/images/I/71dsgC9Hi3L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81qg1ALn1DL._AC_SL1500_.jpg"
    ],
    "categories": ["Laptops", "Computers"]
  },
  {
    "name": "ASUS VivoBook 15 F515 Laptop, 15.6” FHD Display, Intel i3-1115G4 CPU, 8GB DDR4 RAM, 128GB SSD, Windows 11 Home in S Mode, Slate Grey, F515EA-AH34 ",
    "price": 399.99,
    "shippingCost": 21.97,
    "description": "Powerful performance: ASUS Vivobook 15 laptop comes with 11th Generation Intel Core i3-1115G4, 8GB RAM and 128GB of storage, this laptop will help you get things done swiftly and efficiently. Immersive visuals: experience incredible visuals with the 15.6 inch Full HD NanoEdge vIPS display featuring a stunning 83% screen-to-body ratio and an anti-glare coating to reduce unwanted distractions. Durable design: the laptop is carefully constructed to protect internal components, strengthen the hinge joint and provide a stable platform when using the laptop. Comfortable experience: the laptop comes with full-size backlit keyboard is perfect for working in dim environments and is ergonomically designed to provide a comfortable typing experience. Extremely portable: the laptop is only 3.97lbs and 0.7 inches thin, this ASUS laptop will keep up with your fast-paced lifestyle. ",
    "images": [
      "https://m.media-amazon.com/images/I/71GKXeMFy-L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713mll9kjKL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71d7t6qId4L._AC_SL1500_.jpg"
    ],
    "categories": ["Laptops", "Computers"]
  },
  {
    "name": "YEAHTU Laptop Privacy Screen - Fits 13.3' Screen 16:9 Ratio, Privacy Screen Filter with Anti-Blue Light and UV Protection - Protect Your Private Information at Work or in Public",
    "price": 34.9,
    "shippingCost": 11.27,
    "description": "The screen privacy protector effectively protects your laptop from prying eyes, it limits the viewing angle to +/- 30 degrees, data is visible only to persons directly in front of the monitor while prying eyes beside you see only notthing.This privacy screen filter is suitable for public places, offices, classrooms, libraries, subway stations, hospitals, financial institutions, business meetings. The advanced multi-layer film filter will filter 96% of UV rays and suppress 68% of blue light, specially designed to protect your eyes, the privacy screen filter will filter most of the harmful light. The privacy screen is anti-glare. Width: 11 9/16' (293.6mm), Height: 6 1/2' (165mm), Diagonal: 13.3' (337.8mm).Please confirm the width and height measurements for your computer screen before ordering. It's not recommended to make your selection based solely on your computer screen's diagonal size. If you have any questions about the size, please contact us. Simply place the privacy screen on the top and side of the laptop and let the magnets attach along the screen. No more adhesive. Easily remove and reconnect when needed; reusable computer privacy screen. At the same time prevent fingerprints/oil stains, keep the screen clean and prevent the screen from being physically scratched. NOTE: When the privacy screen is connected, your laptop will shut down completely and sleep mode will still be in effect. Thank you for your choice! If you have any questions during use, please feel free to contact us, we will reply you quickly within 24 hours to solve any questions you have. Have a nice day",
    "images": [
      "https://m.media-amazon.com/images/I/61ooQoEYHbL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61FItl2fxRL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/619DeVuRihL._AC_SL1500_.jpg"
    ],
    "categories": ["Laptops", "Computers"]
  },
  {
    "name": "HP Pavilion 15 Laptop, 11th Gen Intel Core i7-1165G7 Processor, 16 GB RAM, 512 GB SSD Storage, Full HD IPS Micro-Edge Display, Windows 11 Pro, Compact Design, Long Battery Life (15-eg0025nr, 2021) ",
    "price": 888.0,
    "shippingCost": 76.69,
    "description": "INSTANT GRATIFICATION – Experience a laptop with premium performance, so you can spend less time getting more done; it’s like a small PC that’s compact enough to go where you go with a long-lasting battery to power you through your day. EPIC ENTERTAINMENT – With audio by B&O, a larger screen-to-body ratio, and a 15.6-inch Full HD micro-edged screen to maximize your view, entertainment on your laptop feels like bringing the theater home (1). IMPRESSIVE GRAPHICS – The Intel Iris Xe Graphics gives you a new level of graphics performance with crisp, stunning visuals, plus the convenience of a thin and light laptop (2). IMPRESSIVE GRAPHICS – The Intel Iris Xe Graphics gives you a new level of graphics performance with crisp, stunning visuals, plus the convenience of a thin and light laptop (2). UNSTOPPABLE PERFORMANCE – Get things done fast with the 11th Generation Intel Core i7-1165G7 processor, which delivers instant responsiveness and best-in-class connectivity (3). MEMORY AND STORAGE – Enjoy up to 15x faster performance than a traditional hard drive with 512 GB PCIe NVMe M.2 SSD storage (4) and experience improved multitasking with higher bandwidth thanks to 16 GB of RAM. WORK ON THE GO – Get work done on the go with a long battery life of up to 8 hours (5) while HP Fast Charge lets you go from 0 to 50% charge in approximately 45 minutes (6). OS AND WARRANTY – Do more with better peace of mind thanks to the HP 1-year limited hardware warranty and the seamlessly integrated Windows 10 Pro operating system (7); get ready for the Windows 11 upgrade, coming soon and at no additional cost (8).",
    "images": [
      "https://m.media-amazon.com/images/I/711Nx6ZoRML._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71P1GRd2sbL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/713nL7Wt7VL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71oi1fFcqtL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71DZ+DbmkWL._AC_SL1500_.jpg"
    ],
    "categories": ["Laptops", "Computers"]
  },
  {
    "name": "2021 Newest Dell Business Laptop Latitude 3520, 15.6' FHD IPS Backlit Display, i7-1165G7, 32GB RAM, 512GB SSD, Webcam, WiFi 6, USB-C, HDMI, Win 10 Pro",
    "price": 1349.0,
    "shippingCost": 269.58,
    "description": "Windows 10 Pro 64-bit, ideal for business, enterprise and commercial use. Free upgrade to Windows 11 when available. 32GB high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once. 512GB PCIe NVMe M.2 Solid State Drive provides fast bootup and speedy data transfer. 11th Gen Intel Core i7-1165G7 Processor (4 Cores, 8 Threads, 12MB Cache, 2.80 GHz base frequency, up to 4.70 GHz max turbo frequency) offers business the performance, manageability, built-in security features, and stability of the Intel vPro Platform, the platform built for business. 15.6-inch diagonal FHD (1920 x 1080) Anti-Glare Non-Touch Display, 250nits. 1 x USB 2.0, 2 x USB 3.2 Gen 1 Type-A, 1 x HDMI 1.4, 2 x USB 3.2 Gen 2x2 Type-C™ port with DisplayPort Alt mode, 1 x Headphone/Microphone Combo Jack, 1 x uSD 3.0 Memory Card Reader, 1 X RJ-45 with Status LED; HD (720p) webcam with privacy shutter and digital microphones; Dual Stereo speakers; Intel Wi-Fi 6 AX201 2x2 802.11ax 160MHz + Bluetooth 5.1.",
    "images": [
      "https://m.media-amazon.com/images/I/71LQep7UcyL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51YbkYRY9fL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ym5GlDtFL._AC_SL1500_.jpg"
    ],
    "categories": ["Computers", "Laptops"]
  }
]
